modules/HumanResource/Http/Controllers/EmployeeController.php

select * from `employees` where `employees`.`deleted_at` is null
select * from `genders` where `genders`.`deleted_at` is null order by `id` desc
select * from `marital_statuses`
select * from `positions` where `is_active` = 1 and `positions`.`deleted_at` is null order by `id` desc
select * from `departments` where `parent_id` is null and `is_active` = 1 and `departments`.`deleted_at` is null order by `id` desc
select * from `departments` where `parent_id` is not null and `is_active` = 1 and `departments`.`deleted_at` is null order by `id` desc
select * from `countries` where `countries`.`deleted_at` is null
select * from `employee_types` where `is_active` = 1
---
    public function index(EmployeeDataTable $dataTables)
    {
        $employees = Employee::all();
        $genders = Gender::all();
        $marital_statuses = MaritalStatus::all();
        $positions = Position::where('is_active', true)->get();
        $departments = Department::whereNull('parent_id')->where('is_active', true)->get();
        $sub_departments = Department::whereNotNull('parent_id')->where('is_active', true)->get();
        $countries = Country::all();
        $employeeTypes = EmployeeType::where('is_active', true)->get();

select * from `employees` where `is_active` = 0 and `employees`.`deleted_at` is null
select * from `genders` where `genders`.`deleted_at` is null order by `id` desc
select * from `marital_statuses`
select * from `positions` where `is_active` = 1 and `positions`.`deleted_at` is null order by `id` desc
select * from `departments` where `parent_id` is not null and `is_active` = 1 and `departments`.`deleted_at` is null order by `id` desc
select * from `countries` where `countries`.`deleted_at` is null
select * from `employee_types` where `is_active` = 1
---
    public function inactive_list(InactiveEmployeeDataTable $dataTables)
    {
        $employees = Employee::where('is_active', false)->get();
        $genders = Gender::all();
        $marital_statuses = MaritalStatus::all();
        $positions = Position::where('is_active', true)->get();
        $departments = Department::whereNull('parent_id')->where('is_active', true)->get();
        $sub_departments = Department::whereNotNull('parent_id')->where('is_active', true)->get();
        $countries = Country::all();
        $employeeTypes = EmployeeType::where('is_active', true)->get();

select * from `positions` where `is_active` = 1 and `positions`.`deleted_at` is null order by `id` desc
select * from `departments` where `parent_id` is null and `is_active` = 1 and `departments`.`deleted_at` is null order by `id` desc
select * from `departments` where `parent_id` is not null and `is_active` = 1 and `departments`.`deleted_at` is null order by `id` desc
select * from `pay_frequencies` where `is_active` = 1 and `pay_frequencies`.`deleted_at` is null order by `id` desc
select * from `duty_types` where `is_active` = 1
select * from `setup_rules` where `is_active` = 1 and `setup_rules`.`deleted_at` is null order by `id` desc
select * from `setup_rules` where `is_active` = 1 and `type` = 'basic' and `setup_rules`.`deleted_at` is null order by `id` desc limit 1
select * from `employees` where `is_active` = 1 and `employees`.`deleted_at` is null
select * from `countries` where `countries`.`deleted_at` is null
---
    public function create()
    {
        $positions = Position::where('is_active', true)->get();
        $parent_departments = Department::whereNull('parent_id')->where('is_active', true)->get();
        $sub_departments = Department::whereNotNull('parent_id')->where('is_active', true)->get();
        $pay_frequencies = PayFrequency::where('is_active', true)->get();
        $duty_types = DutyType::where('is_active', 1)->get();
        $setup_rules = SetupRule::where('is_active', true)->get();
        $basic_setup_rule = SetupRule::where('is_active', true)->where('type', 'basic')->first();
        $employees = Employee::where('is_active', true)->get();

        $times = $setup_rules->filter(function ($value) {
            return $value->type == 'time';
        });

        $deductions = $setup_rules->filter(function ($value) {
            return $value->type == 'deduction';
        });

        $allowances = $setup_rules->filter(function ($value) {
            return $value->type == 'allowance';
        });

        return view('humanresource::employee.create', [
            'positions' => $positions,
            'departments' => $parent_departments,
            'sub_departments' => $sub_departments,
            'countries' => Country::all(),

select * from `employee_types` where `is_active` = 1
select * from `genders` where `genders`.`deleted_at` is null order by `id` desc
select * from `marital_statuses`
select * from `certificate_types`
---
            'allowances' => $allowances,
            'basic_setup_rule' => $basic_setup_rule,
            'pay_frequencies' => $pay_frequencies,
            'employee_types' => EmployeeType::where('is_active', true)->get(),
            'duty_types' => $duty_types,
            'genders' => Gender::all(),
            'marital_statuses' => MaritalStatus::all(),
            'certificate_types' => CertificateType::all(),

select * from `employees` where `id` = '24' and `employees`.`deleted_at` is null limit 1
select * from `bank_infos` where `employee_id` = 24 and `bank_infos`.`deleted_at` is null order by `id` desc limit 1
select * from `employee_files` where `employee_id` = 24 and `employee_files`.`deleted_at` is null order by `id` desc limit 1
select * from `employee_salary_types` where `employee_salary_types`.`setup_rule_id` in (1, 2, 3, 4, 5, 6) and `employee_id` = 24 and `employee_salary_types`.`deleted_at` is null
select * from `setup_rules` where `is_active` = 1 and `setup_rules`.`deleted_at` is null order by `id` desc
---
    public function show($id)
    {
        $employee      = Employee::where('id', $id)->firstOrFail();
        $bank_info     = BankInfo::where('employee_id', $employee->id)->first();
        $employee_file = EmployeeFile::where('employee_id', $employee->id)->first();

        $rules = SetupRule::where('is_active', true)->with('employee_salary_types', function ($q) use ($employee) {
            return $q->where('employee_id', $employee->id);
        })->get();

select * from `employee_salary_types` where `employee_salary_types`.`employee_id` in (42) and `employee_salary_types`.`deleted_at` is null
select * from `employees` where `id` = '42' and `employees`.`deleted_at` is null limit 1
select * from `bank_infos` where `employee_id` = 42 and `bank_infos`.`deleted_at` is null order by `id` desc limit 1
select * from `employee_files` where `employee_id` = 42 and `employee_files`.`deleted_at` is null order by `id` desc limit 1
select * from `positions` where `is_active` = 1 and `positions`.`deleted_at` is null order by `id` desc
select * from `departments` where `parent_id` is null and `is_active` = 1 and `departments`.`deleted_at` is null order by `id` desc
select * from `departments` where `parent_id` is not null and `is_active` = 1 and `departments`.`deleted_at` is null order by `id` desc
select * from `setup_rules` where `is_active` = 1 and `type` = 'basic' and `setup_rules`.`deleted_at` is null order by `id` desc limit 1
select * from `setup_rules` where `is_active` = 1 and `setup_rules`.`deleted_at` is null order by `id` desc
select * from `pay_frequencies` where `is_active` = 1 and `pay_frequencies`.`deleted_at` is null order by `id` desc
select * from `employee_types` where `is_active` = 1
select * from `duty_types` where `is_active` = 1
select * from `genders` where `genders`.`deleted_at` is null order by `id` desc
---
    public function edit($id)
    {
        $employee = Employee::with(['employee_salary_types'])->where('id', $id)->firstOrFail();
        $bank_info = BankInfo::where('employee_id', $employee->id)->first();
        $employee_file = EmployeeFile::where('employee_id', $employee->id)->first();

        $positions = Position::where('is_active', true)->get();
        $parent_departments = Department::whereNull('parent_id')->where('is_active', true)->get();
        $sub_departments = Department::whereNotNull('parent_id')->where('is_active', true)->get();
        $basic_setup_rule = SetupRule::where('is_active', true)->where('type', 'basic')->first();
        $setup_rules = SetupRule::where('is_active', true)->get();

        $basic_salary = $employee->employee_salary_types->where('type', 'basic')->first();
        $allowances = $employee->employee_salary_types->where('type', 'allowance');
        $deductions = $employee->employee_salary_types->where('type', 'deduction');
        $bonuses = $employee->employee_salary_types->where('type', 'bonus');

        $times = $setup_rules->filter(function ($value) {
            return $value->type == 'time';
        });

        $pay_frequencies = PayFrequency::where('is_active', true)->get();
        $employee_types = EmployeeType::where('is_active', true)->get();
        $duty_types = DutyType::where('is_active', true)->get();
        $genders = Gender::all();

select * from `countries` where `countries`.`deleted_at` is null
---
            'positions' => $positions,
            'departments' => $parent_departments,
            'sub_departments' => $sub_departments,
            'countries' => Country::all(),

select * from `marital_statuses`
---
            'employee_types' => $employee_types,
            'duty_types' => $duty_types,
            'genders' => $genders,
            'marital_statuses' => MaritalStatus::all(),