modules/HumanResource/Http/Controllers/ManualAttendanceController.php

    public function index(Request $request)
    {
        $date = $request->date ?? Carbon::now()->toDateString();

        $employees = Employee::with(['position:id,position_name', 'attendances' => function ($query) use ($date) {
            $query->whereDate('time', $date);
        }])
            ->where('is_active', true)
            ->get(['id', 'first_name', 'middle_name', 'last_name', 'position_id', 'employee_id']);
---
select * from `attendances` where `attendances`.`employee_id` in (19, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42) and date(`time`) = '2025-02-08' and `attendances`.`deleted_at` is null
select `id`, `first_name`, `middle_name`, `last_name`, `position_id`, `employee_id` from `employees` where `is_active` = 1 and `employees`.`deleted_at` is null
select `id`, `position_name` from `positions` where `positions`.`id` in (5, 6, 7, 9, 10, 11, 12, 13, 14, 15, 16, 17) and `positions`.`deleted_at` is null order by `id` desc

    public function create()
    {
        $employee = Employee::where('is_active', 1)->get();
---
select * from `employees` where `is_active` = 1 and `employees`.`deleted_at` is null

    public function missingAttendance(Request $request)
    {
        $date = $request->date;
        // if date is not set then set current date
        if (!$date) {
            $date = Carbon::now()->format('Y-m-d');
        } else {
            $date = Carbon::parse($date)->format('Y-m-d');
        }
        $missingAttendance = Employee::with(['position:id,position_name'])->doesntHave('attendances', 'and', function ($query) use ($date) {
            $query->whereDate('time', $date);
        })->where('is_active', true)->get(['id', 'first_name', 'middle_name', 'last_name', 'position_id', 'employee_id']);
---
select `id`, `first_name`, `middle_name`, `last_name`, `position_id`, `employee_id` from `employees` where not exists (select * from `attendances` where `employees`.`id` = `attendances`.`employee_id` and date(`time`) = '2025-02-16' and `attendances`.`deleted_at` is null) and `is_active` = 1 and `employees`.`deleted_at` is null
select `id`, `position_name` from `positions` where `positions`.`id` in (7, 9, 10, 11, 12, 13, 14, 15, 16, 17) and `positions`.`deleted_at` is null order by `id` desc

    public function missingAttendanceStore(Request $request)
    {
        $request->validate([
            'employee_id' => 'required|array',
            'employee_id.*' => 'required|integer',
            'in_time' => 'required|array',
            'in_time.*' => 'required|date_format:H:i',
            'out_time' => 'required|array',
            'out_time.*' => 'required|date_format:H:i',
            'date' => 'required|date',
        ]);
        try {
            DB::beginTransaction();
            $in_time = $request->in_time;
            $out_time = $request->out_time;
            $employee_id = $request->employee_id;
            $date = Carbon::parse($request->date);

            foreach ($employee_id as $key => $value) {
                $inDateTime = $date->copy()->modify($in_time[$key]);
                $outDateTime = $date->copy()->modify($out_time[$key]);

                Attendance::create([
                    'employee_id' => $value,
                    'time' => $inDateTime,
                ]);
                Attendance::create([
                    'employee_id' => $value,
                    'time' => $outDateTime,
                ]);
---
insert into `attendances` (`employee_id`, `time`, `updated_at`, `created_at`) values ('19', '2025-02-16 10:26:00', '2025-02-16 18:27:10', '2025-02-16 18:27:10')
insert into `attendances` (`employee_id`, `time`, `updated_at`, `created_at`) values ('19', '2025-02-16 23:26:00', '2025-02-16 18:27:10', '2025-02-16 18:27:10')

    public function checkIn(Request $request)
    {
        $date = $request->date;
        if (!$date) {
            $date = Carbon::now()->format('Y-m-d');
        } else {
            $date = Carbon::parse($date)->format('Y-m-d');
        }
        $missingAttendance = Employee::with(['position:id,position_name'])->doesntHave('attendances', 'and', function ($query) use ($date) {
            $query->whereDate('time', $date);
        })->where('is_active', true)->get(['id', 'first_name', 'middle_name', 'last_name', 'position_id', 'employee_id']);
---
select * from `attendances` where `attendances`.`employee_id` in (19, 22, 23, 24) and date(`time`) = '2025-02-16' and `attendances`.`deleted_at` is null
select `id`, `first_name`, `middle_name`, `last_name`, `position_id`, `employee_id` from `employees` where exists (select * from `attendances` where `employees`.`id` = `attendances`.`employee_id` and date(`time`) = '2025-02-16' and `attendances`.`deleted_at` is null) and `is_active` = 1 and `employees`.`deleted_at` is null
select `id`, `position_name` from `positions` where `positions`.`id` in (5, 6, 7) and `positions`.`deleted_at` is null order by `id` desc

    public function checkInStore(Request $request)
    {
        $request->validate([
            'employee_id' => 'required|array',
            'employee_id.*' => 'required|integer',
            'in_time' => 'required|array',
            'in_time.*' => 'required|date_format:H:i',
            'date' => 'required|date',
        ]);
        try {
            DB::beginTransaction();
            $in_time = $request->in_time;
            $employee_id = $request->employee_id;
            $date = Carbon::parse($request->date);
            foreach ($employee_id as $key => $value) {
                $inDateTime = $date->copy()->modify($in_time[$key]);
                Attendance::create([
                    'employee_id' => $value,
                    'time' => $inDateTime,
                ]);
---
insert into `attendances` (`employee_id`, `time`, `updated_at`, `created_at`) values ('24', '2025-02-16 00:34:00', '2025-02-16 18:34:40', '2025-02-16 18:34:40')

                $checkOut = $records->last();

                // Find employee using both zk_id and device_ip
                $user = DB::table('employees')
                    ->where('zk_id', $zk_userId)
                    ->where('device_ip', $deviceIp)
                    ->first();

                if ($user) {
                    $attendance_exist = Attendance::where('employee_id', $user->id)
                        ->whereDate('time', $date)
                        ->count();

                    if ($attendance_exist == 0 || $attendance_exist == 1) {
                        if ($attendance_exist == 1) {
                            Attendance::where('employee_id', $user->id)->whereDate('time', $date)->forceDelete();
                        }

                        Attendance::create([
                            'employee_id' => $user->id,
                            'time' => $checkIn['timestamp'],
                        ]);
                        Attendance::create([
                            'employee_id' => $user->id,
                            'time' => $checkOut['timestamp'],
                        ]);
---
select * from `employees` where `zk_id` = '2' and `device_ip` = '192.168.1.201' limit 1
select count(*) as aggregate from `attendances` where `employee_id` = 1 and date(`time`) = '2025-02-08' and `attendances`.`deleted_at` is null
delete from `attendances` where date(`time`) = '2025-02-04'
insert into `attendances` (`employee_id`, `time`, `updated_at`, `created_at`) values (19, '2025-02-08 17:30:00', '2025-02-08 13:30:39', '2025-02-08 13:30:39')
insert into `attendances` (`employee_id`, `time`, `updated_at`, `created_at`) values (29, '2025-02-04 14:44:13', '2025-02-04 22:42:50', '2025-02-04 22:42:50')

                $deviceIp = $record['device_ip'];

                // Get user details using zk_id
                $user = DB::table('employees')->where('zk_id', $zk_userId)->first();
---
select * from `employees` where `zk_id` = '1' limit 1

    public function checkOut(Request $request)
    {
        $date = $request->date;
        if (!$date) {
            $date = Carbon::now()->format('Y-m-d');
        } else {
            $date = Carbon::parse($date)->format('Y-m-d');
        }
        $missingAttendance = Employee::with(['position:id,position_name'])
            ->whereHas('attendances', function ($query) use ($date) {
                $query->whereDate('time', $date);
            }, '=', 1)
            ->where('is_active', true)->get(['id', 'first_name', 'middle_name', 'last_name', 'position_id', 'employee_id']);
---
select `id`, `first_name`, `middle_name`, `last_name`, `position_id`, `employee_id` from `employees` where (select count(*) from `attendances` where `employees`.`id` = `attendances`.`employee_id` and date(`time`) = '2025-02-16' and `attendances`.`deleted_at` is null) = 1 and `is_active` = 1 and `employees`.`deleted_at` is null