modules/HumanResource/Http/Controllers/ManualAttendanceController.php

update `attendances` set `time` = '2025-02-16 09:00:00', `attendances`.`updated_at` = '2025-02-16 20:19:28' where `id` = 360
---
    public function editAttendanceStore(Request $request)
    {

        $request->validate([
            'employee_id' => 'required|array',
            'employee_id.*' => 'required|integer',
            'in_time' => 'required|array',
            'in_time.*' => 'required|date_format:H:i',
            'out_time' => 'required|array',
            'out_time.*' => 'required|date_format:H:i',
            'date' => 'required|date',
        ]);
        try {
            DB::beginTransaction();
            $in_time = $request->in_time;
            $out_time = $request->out_time;
            $employee_id = $request->employee_id;
            $date = Carbon::parse($request->date);

            foreach ($employee_id as $key => $value) {
                $inDateTime = $date->copy()->modify($in_time[$key]);
                $outDateTime = $date->copy()->modify($out_time[$key]);
                 $checkin = Attendance::where('employee_id', $value)->whereDate('time', $date)->get();
                if ($checkin[0]) {
                    $checkin[0]->update([
                        'time' => $inDateTime
                    ]) ;

delete from `attendances` where date(`time`) = '2025-01-05'
---

                    if ($attendance_exist == 0 || $attendance_exist == 1) {
                        if ($attendance_exist == 1) {
                            Attendance::where('employee_id', $user->id)->whereDate('time', $date)->forceDelete();