modules/HumanResource/Http/Controllers/ManualAttendanceController.php

select * from `week_holidays` limit 1
select * from `holidays` where month(`start_date`) = '12' and year(`start_date`) = '2024' and `holidays`.`deleted_at` is null order by `id` desc
---
    public function monthlyStore(Request $request)
    {
        $year = $request->year;
        $month = $request->month;
        $in_time = Carbon::parse($request->in_time)->format('H:i:s');
        $out_time = Carbon::parse($request->out_time)->format('H:i:s');
        $manualAttendancesIn = [];
        $manualAttendancesOut = [];
        $daysInMonth = Carbon::create($year, $month)->daysInMonth;
        $weeklyHoliday = WeekHoliday::first();

        $publicHoliday = Holiday::whereMonth('start_date', $month)->whereYear('start_date', $year)->get()->toArray();

select `id`, `first_name`, `middle_name`, `last_name`, `position_id`, `employee_id` from `employees` where not exists (select * from `attendances` where `employees`.`id` = `attendances`.`employee_id` and date(`time`) = '2024-12-31' and `attendances`.`deleted_at` is null) and `is_active` = 1 and `employees`.`deleted_at` is null
---
    public function missingAttendance(Request $request)
    {
        $date = $request->date;
        // if date is not set then set current date
        if (!$date) {
            $date = Carbon::now()->format('Y-m-d');
        } else {
            $date = Carbon::parse($date)->format('Y-m-d');
        }
        $missingAttendance = Employee::with(['position:id,position_name'])->doesntHave('attendances', 'and', function ($query) use ($date) {
            $query->whereDate('time', $date);
        })->where('is_active', true)->get(['id', 'first_name', 'middle_name', 'last_name', 'position_id', 'employee_id']);

select * from `attendances` where `employee_id` = '19' and date(`time`) = '2025-02-16' and `attendances`.`deleted_at` is null
---
    public function checkOut(Request $request)
    {
        $date = $request->date;
        if (!$date) {
            $date = Carbon::now()->format('Y-m-d');
        } else {
            $date = Carbon::parse($date)->format('Y-m-d');
        }
        $missingAttendance = Employee::with(['position:id,position_name'])
        ->whereHas('attendances', function ($query) use ($date) {
            $query->whereDate('time', $date);
        }, '=', 1)
        ->where('is_active', true)->get(['id', 'first_name', 'middle_name', 'last_name', 'position_id', 'employee_id']);

insert into `attendances` (`employee_id`, `time`, `updated_at`, `created_at`) values (29, '2025-02-04 14:44:13', '2025-02-04 22:36:03', '2025-02-04 22:36:03')
---
    public function checkOutStore(Request $request)
    {
        $request->validate([
            'employee_id' => 'required|array',
            'employee_id.*' => 'required|integer',
            'out_time' => 'required|array',
            'out_time.*' => 'required|date_format:H:i',
            'date' => 'required|date',
        ]);
        try {
            DB::beginTransaction();
            $out_time = $request->out_time;
            $employee_id = $request->employee_id;
            $date = Carbon::parse($request->date);

            foreach ($employee_id as $key => $value) {
                $outDateTime = $date->copy()->modify($out_time[$key]);
                Attendance::create([
                    'employee_id' => $value,
                    'time' => $outDateTime,
                ]);
                $attendance_history = [
                    'uid'    => $value,
                    'state'  => 1,
                    'id'     => 0,
                    'time'   => $outDateTime,
                ];
                $resp_attend = $this->insert_attendance_point($attendance_history);