modules/HumanResource/Http/Controllers/ReportController.php

select * from `departments` where `is_active` = 1 and `departments`.`deleted_at` is null order by `id` desc
select `id`, `first_name`, `last_name`, `middle_name` from `employees` where `is_active` = 1 and `employees`.`deleted_at` is null
select * from `leave_types` where `leave_types`.`deleted_at` is null order by `id` desc
---
    public function leaveReport(Request $request, LeaveReportDataTable $dataTable)
    {
        return $dataTable->render('humanresource::reports.leave', [
            'departments' => Department::where('is_active', true)->get(),
            'employees' => Employee::where('is_active', true)->get(['id', 'first_name', 'last_name', 'middle_name']),
            'leave_types' => LeaveType::all(),
        ]);