modules/HumanResource/Http/Controllers/SalaryGenerateController.php

select * from `salary_sheet_generates` where `salary_sheet_generates`.`deleted_at` is null order by `id` desc
---
    public function salaryGenerateForm()
    {
        return view('humanresource::salary-generate.salary-sheet', [
            'salary_sheets' => SalarySheetGenerate::all(),
        ]);

select * from `salary_sheet_generates` where `name` = '2025-02' and `salary_sheet_generates`.`deleted_at` is null order by `id` desc limit 1
select * from `applications` limit 1
---
    public function salaryGenerate(Request $request)
    {
        $request->validate([
            'salary_month' => 'required',
        ]);

        if (SalarySheetGenerate::where('name', $request->salary_month)->first()) {
            Toastr::error('Salary already generated for this month :)', 'Error');

            return redirect()->back();
        }
        DB::beginTransaction();
        try {
            $setting = Application::first();

select * from `salary_sheet_generates` where `uuid` = '936758ea-3a47-4926-9e9f-96a4d542e9f2' and `salary_sheet_generates`.`deleted_at` is null order by `id` desc limit 1
select * from `salary_generates` where `salary_month_year` = '2025-01' and `salary_generates`.`deleted_at` is null
---
    public function destroy($uuid)
    {
        DB::beginTransaction();
        try {

            $salaryGenerateDelete = SalarySheetGenerate::where('uuid', $uuid)->first();
            if ($salaryGenerateDelete->is_approved == 1) {
                return redirect()->back()->with('fail', localize('can_not_be_deleted_as_it_is_already_approved'));
            }

            // Start of reversing loan and salary advance amount if applied for any employee salary...for the month
            $salaries = SalaryGenerate::where('salary_month_year', $salaryGenerateDelete->name)->get();

update `salary_generates` set `deleted_at` = '2025-02-05 20:01:24', `salary_generates`.`updated_at` = '2025-02-05 20:01:24' where `salary_month_year` = '2025-01' and `salary_generates`.`deleted_at` is null
---
                }
            }

            SalaryGenerate::where('salary_month_year', $salaryGenerateDelete->name)->delete();