modules/HumanResource/Http/Controllers/ZKAttendanceController.php

select * from `employees` where `zk_id` = '1' and `device_ip` = '192.168.1.201' limit 1
select count(*) as aggregate from `attendances` where `employee_id` = 19 and date(`time`) = '2025-02-25' and `attendances`.`deleted_at` is null
---
    public function ZkAttendance(Request $request)
    {
        try {
            $groupedLogs = $request->data;
            $deviceIp = $request->deviceIp;
            DB::beginTransaction();

            foreach ($groupedLogs as $key => $records) {
                $records = collect($records)->sortBy('timestamp')->values();

                list($deviceIp, $zk_userId, $date) = explode('_', $key);

                $checkIn = $records->first();
                $checkOut = $records->last();

                $user = DB::table('employees')
                    ->where('zk_id', $zk_userId)
                    ->where('device_ip', $deviceIp)
                    ->first();

                if ($user) {
                    $attendance_exist = Attendance::where('employee_id', $user->id)
                        ->whereDate('time', $date)
                        ->count();

select * from `employees` where `zk_id` = '1' limit 1
---
    public function ZkMonthlyAttendance(Request $request)
    {
        try {
            $formattedLogs = [];
            $lastMonthLogs = $request->data;
            foreach ($lastMonthLogs as $record) {
                $zk_userId = $record['id'];
                $timestamp = $record['timestamp'];
                $deviceIp = $record['device_ip'];
                $user = DB::table('employees')->where('zk_id', $zk_userId)->first();