modules/Localize/Http/Controllers/LanguageController.php

    public function languagelist()
    {
        $langList_DB = DB::table('lang')->where('id', '<>', 1)->get();
        $languageList = Language::paginate(10);
---
select * from `lang` where `id` <> 1
select * from `languages` limit 10 offset 0
select count(*) as aggregate from `languages`

    public function setAppLocale($locale)
    {
        app()->setLocale($locale);
        Session::put('applocale', $locale);
        $direction = $locale == 'ar' ? 2 : 1;
        $lang = $locale == 'ar' ? 2 : 1;
        $application = Application::first();
        if ($application) {
            $application->update([
                'rtl_ltr' => $direction,
                'language_id' => $lang,
            ]);
---
select * from `applications` limit 1
update `applications` set `language_id` = 1, `rtl_ltr` = 1, `applications`.`updated_at` = '2024-12-31 18:18:59' where `id` = 1